app/views/links/show.html.erb

SELECT COUNT(*) FROM `comments` WHERE `comments`.`link_id` = 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`link_id` = 1
---
<div class="comments_title pull-left">
    <%= @link.comments.count %> Comments