app/controllers/comments_controller.rb

SELECT  `links`.* FROM `links` WHERE `links`.`id` = NULL LIMIT 1
---
  def create
    lid = params[:link_id] == nil ? params[:comment][:link_id] : params[:link_id]
    @link = Link.find(lid)

DELETE FROM `comments` WHERE `comments`.`id` = 980190962
---
  def destroy
    @address = @comment.link_id
    @comment.destroy

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 980190962 LIMIT 1
---
    def set_comment
      @comment = Comment.find(params[:id])