app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT `links`.* FROM `links`

  def create
    @link = current_user.links.build(link_params)
    flash[:notice] = 'Link was successfully created.' if @link.save
---
INSERT INTO `links` (`title`, `url`, `user_id`, `created_at`, `updated_at`) VALUES ('Google', 'www.google.com', 1, '2015-05-31 09:45:34', '2015-05-31 09:45:34')

  def update
    #@link = Link.find(params[:id])
    respond_with(@link) do |format|
      if @link.update(link_params)
---
UPDATE `links` SET `title` = 'Updated MYINFO', `url` = 'http://www.miamioh.edu', `updated_at` = '2015-07-06 13:56:00' WHERE `links`.`id` = 1

  def destroy
    @link.destroy
---
DELETE FROM `links` WHERE `links`.`id` = 1